sadikoglutaner/STM32/frq_meter_ADC_PCF8574__UART2.c
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include <string.h>

/* USER CODE BEGIN Includes */

#include "lcd_txt.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

#define SLAVE_ADDRESS_PCF8574T 0x4E // change this according to ur setup
#define PACKET_SIZE_OF_I2C 1

/* Private variables ---------------------------------------------------------*/
uint32_t frequency,dem=0;
int timer_counter = 0;
int ADCvalue;
int volt = 0;

char txData[40] = "Hello from STM32F4 Discovery\r\n";
char rxData[40];

struct panel_timer
{
	float timer_counter;
	int ext_irq;
}T0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void PCF_send_data (char data);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
	char str[30];
	char name[20];
//	struct panel_timer T0;// = {0,};

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
	
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_ADC1_Init();
  MX_I2C1_Init();
  MX_USART2_UART_Init();
 	lcd_init();
	
 	HAL_TIM_Base_Start_IT(&htim1);
 	HAL_ADC_Start(&hadc1);
	
  /* USER CODE BEGIN 2 */
  lcd_puts(0,0, (int8_t*) "--Taner SADIKOGLU--");
	HAL_Delay(1000);
	
	lcd_clear();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		
	if(HAL_ADC_PollForConversion(&hadc1,100) == HAL_OK)
{
		ADCvalue = HAL_ADC_GetValue(&hadc1);
}

	PCF_send_data(255-(ADCvalue/16));

//	HAL_UART_Transmit(&huart2, (uint8_t *)&txData[0], 1, 10);
//	txData[0]++;
//	if(txData[0] > '9') txData[0] = '0';


	HAL_UART_Transmit(&huart2, (uint8_t *)txData, strlen(txData), 1000); 
		
	sprintf(str,"Freq = %u Hz",frequency); //frequency
  lcd_puts(0,0,(int8_t*) str);
		
	sprintf(str,"Volt: = %.3f ",ADCvalue * (255.0/4095.0));
	lcd_puts(1,0,(int8_t*) str);
		
	sprintf(str,"T0: = %0.2f ",T0.timer_counter);
	lcd_puts(2,0,(int8_t*) str);
		
	sprintf(name,"Taner SADIKOGLU");
  lcd_puts(3,0, (int8_t*) name);
		
		
	HAL_Delay(100);

  }
  /* USER CODE END 3 */
}

	void PCF_send_data (char data)
{
	uint8_t data_t[1];
	data_t[0] = data;

	HAL_I2C_Master_Transmit (&hi2c1, SLAVE_ADDRESS_PCF8574T,(uint8_t *) data_t, PACKET_SIZE_OF_I2C, 100);
}

// external int
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
	{
		if(GPIO_Pin==GPIO_PIN_0)
			{
				// to do
				dem++;
				
				
				HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14|GPIO_PIN_15);
			}
			
			
	}
	
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
	{
		if(TIM1==htim->Instance)
			{
				// to do
				frequency=dem*2;
				dem=0;
				timer_counter = timer_counter + 1;
				T0.timer_counter = T0.timer_counter + 0.01;
				
				HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
			}
	}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

